from pprint import pprint
N = 11
yj_Adams =[1, 0.9524105249875516, 0.9092239706720135, 0.869656387480169, 0.833391122300947, 0.8000306891134922,
           0.7692397663019952, 0.7407327655605568, 0.7142649788725487, 0.6896254485831705, 0.6666312901845679]
yj_Eiler= [1, 0.9546443792469136, 0.9132937023828638, 0.8754045750063497, 0.8405164366530734, 0.8082410723808441,
           0.7782541266470864, 0.7502877446615654, 0.7241235778377619, 0.6995856639992281, 0.6765330375002587]
yj_PPT = [1, 0.9523265277777778, 0.9089973703122821, 0.8694477329046442, 0.8332064725521847, 0.7998772715382005,
          0.7691241393140343, 0.7406601646673993, 0.7142387380479464, 0.6896466665694934, 0.6666987430100222]
yj_Runge_Kutt = [1, 0.9523670700034702, 0.9090692328012411, 0.8695426391530247, 0.833316802859214, 0.7999959572093923,
                  0.7692446894923178, 0.7407767803167519, 0.7143464686168776, 0.6897415663754577, 0.6667779891539297]
E_arr1 = []
E_arr2 = []
E_arr3 = []
for i in range(N):
    E_arr1.append(abs(yj_Adams[i]-yj_Eiler[i]))
    E_arr2.append(abs(yj_Adams[i] - yj_PPT[i]))
    E_arr3.append(abs(yj_Adams[i] - yj_Runge_Kutt[i]))
print("Погрешность метода Эйлера:")
pprint(E_arr1)
print("Погрешность метода ППТ:")
pprint(E_arr2)
print("Погрешность метода Рунге-Кутта:")
pprint(E_arr3)
sumE = 0
sumPPT = 0
sumRungeKutt = 0
for i in range(N):
    sumE += E_arr1[i]
    sumPPT += E_arr2[i]
    sumRungeKutt += E_arr3[i]
print("Глобальная погрешность м.Эйлера:", sumE)
print("Глобальная погрешность м.ППТ:", sumPPT)
print("Глобальная погрешность м.Рунге-Кутта:", sumRungeKutt)


